<?php
if (!defined('WEB_PATH')) exit();

//系统错误码配置
return  array(
	//系统错误码
	"SYSTEM_ERRORCODE"	=> array(
		//公共部分错误码
		"200"	=> "%s操作成功!",
		'904' => "获取执行信息的信息码不能为空",
		'909'	=> "字段[%s]不能为空",
		'910'	=> "字段[%s]超过字符长度限制",
		'911'	=> "字段[%s]超过整型字段长度限制",
		'912'	=> "字段[%s]超过小数字段长度限制",
		'913'	=> "数据表[%s]不存在字段[%s]",
		'914'	=> "Validate->getTableColumns初始化正则函数匹配[%s]类型不全",
		'918'	=> "数据正确性验证，插入数据,数据库缺少[%s]字段",
		'919'	=> "数据库执行函数[%s]和对应的SQL[%s]不匹配",
		'920'	=> "[%s]执行的SQL语句为空",
		'921'	=> "代码错误，没有[%s]这个方法",
		'922'	=> "[%s]格式检查错误（必须是数组）",
		"10001"	=> "%s操作失败!",
		"10002"	=> "不存在%s！",
		"10003"	=> "%s已经存在！",
		"10004"	=> "获取执行信息的信息码不能为空",
		"10005"	=> "%s错误",
		"10006"	=> "%s可用",
		"10007"	=> "未获取到%s信息！",
		"10008"	=> "参数%s为空！",
		"10009"	=> "%s格式非法！",
		"10010" => "没有权限执行该操作",
		"10015"	=> "获取提示消息参数为空",
		"10016"	=> "未获取提示码%s的提示信息",
		"10017"	=> "%s邮件成功发送！",
		"10018"	=> "未知类型的%s",
		"10019"	=> "未获取到必填参数%s",
		'10020' => '异常信息：%s',
		'10030' => '%s与产品中心料号不符，费用计算失败！',


		//单一用途错误码
		"20001"	=> "该用户尚未注册！",
		"20002"	=> "尚未激活！",
		"20003"	=> "用户名或邮箱错误！",
		"20004"	=> "未输入验证信息！",
		"20005"	=> "起止时间不正确！",
		"20006"	=> "邮件发送失败！",
		"20007"	=> "两次输入的密码不一致！",
		"20008"	=> "注册成功，发送邮件失败！",
		"20009"	=> "非法用户名",
		"20010"	=> "非法邮箱格式",
		"20011"	=> "验证邮箱已过期",
		"20012"	=> "身份验证失败",
		"20013"	=> "未修改任何内容",
		"20014"	=> "缺少必填项",

		//订单
		"30000"	=> "标记发货异常",
		"30001"	=> "已经标记发货",
		"30002"	=> "跟踪号有误",
		"30003" => "平台后台处理异常",
		"30004"	=> "该订单状态不允许推送",
		"30005"	=> "该订单状态不能参与合并",

		//范本
		"40001" => "该范本错误，请删除之后重新新增20",
		"40002" => "图片上传失败",
	),
);
?>